Comment:Comparison of batch size to select best one
---Data augmentation config:---
stretch_std: 0.08
magnitude_std: 0.08
stretch_prob: 0.5
noise_std: 0.08
brow_std: 0.9
opt_aug: False
---Data train config:---
n_epochs_max: 100
lr: 0.0001
batch_size: 128
early_stopping_patience: 18
brow_aug_use: True
use_weights: True
---Data load config:---
min_perc_test: 4
max_perc_test: 15
---Model summary:---
Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 700, 1)]     0           []                               
                                                                                                  
 conv1d (Conv1D)                (None, 350, 64)      256         ['input[0][0]']                  
                                                                                                  
 batch_normalization (BatchNorm  (None, 350, 64)     256         ['conv1d[0][0]']                 
 alization)                                                                                       
                                                                                                  
 activation (Activation)        (None, 350, 64)      0           ['batch_normalization[0][0]']    
                                                                                                  
 max_pooling1d (MaxPooling1D)   (None, 175, 64)      0           ['activation[0][0]']             
                                                                                                  
 conv1d_1 (Conv1D)              (None, 175, 64)      12352       ['max_pooling1d[0][0]']          
                                                                                                  
 batch_normalization_1 (BatchNo  (None, 175, 64)     256         ['conv1d_1[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_1 (Activation)      (None, 175, 64)      0           ['batch_normalization_1[0][0]']  
                                                                                                  
 conv1d_2 (Conv1D)              (None, 175, 64)      12352       ['activation_1[0][0]']           
                                                                                                  
 batch_normalization_2 (BatchNo  (None, 175, 64)     256         ['conv1d_2[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 add (Add)                      (None, 175, 64)      0           ['batch_normalization_2[0][0]',  
                                                                  'max_pooling1d[0][0]']          
                                                                                                  
 activation_2 (Activation)      (None, 175, 64)      0           ['add[0][0]']                    
                                                                                                  
 conv1d_3 (Conv1D)              (None, 175, 64)      12352       ['activation_2[0][0]']           
                                                                                                  
 batch_normalization_3 (BatchNo  (None, 175, 64)     256         ['conv1d_3[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_3 (Activation)      (None, 175, 64)      0           ['batch_normalization_3[0][0]']  
                                                                                                  
 conv1d_4 (Conv1D)              (None, 175, 64)      12352       ['activation_3[0][0]']           
                                                                                                  
 batch_normalization_4 (BatchNo  (None, 175, 64)     256         ['conv1d_4[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 add_1 (Add)                    (None, 175, 64)      0           ['batch_normalization_4[0][0]',  
                                                                  'activation_2[0][0]']           
                                                                                                  
 activation_4 (Activation)      (None, 175, 64)      0           ['add_1[0][0]']                  
                                                                                                  
 conv1d_5 (Conv1D)              (None, 175, 64)      12352       ['activation_4[0][0]']           
                                                                                                  
 batch_normalization_5 (BatchNo  (None, 175, 64)     256         ['conv1d_5[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_5 (Activation)      (None, 175, 64)      0           ['batch_normalization_5[0][0]']  
                                                                                                  
 conv1d_6 (Conv1D)              (None, 175, 64)      12352       ['activation_5[0][0]']           
                                                                                                  
 batch_normalization_6 (BatchNo  (None, 175, 64)     256         ['conv1d_6[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 add_2 (Add)                    (None, 175, 64)      0           ['batch_normalization_6[0][0]',  
                                                                  'activation_4[0][0]']           
                                                                                                  
 activation_6 (Activation)      (None, 175, 64)      0           ['add_2[0][0]']                  
                                                                                                  
 conv1d_7 (Conv1D)              (None, 88, 128)      24704       ['activation_6[0][0]']           
                                                                                                  
 batch_normalization_7 (BatchNo  (None, 88, 128)     512         ['conv1d_7[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_7 (Activation)      (None, 88, 128)      0           ['batch_normalization_7[0][0]']  
                                                                                                  
 conv1d_8 (Conv1D)              (None, 88, 128)      49280       ['activation_7[0][0]']           
                                                                                                  
 batch_normalization_8 (BatchNo  (None, 88, 128)     512         ['conv1d_8[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 conv1d_9 (Conv1D)              (None, 88, 128)      8320        ['activation_6[0][0]']           
                                                                                                  
 add_3 (Add)                    (None, 88, 128)      0           ['batch_normalization_8[0][0]',  
                                                                  'conv1d_9[0][0]']               
                                                                                                  
 activation_8 (Activation)      (None, 88, 128)      0           ['add_3[0][0]']                  
                                                                                                  
 conv1d_10 (Conv1D)             (None, 88, 128)      49280       ['activation_8[0][0]']           
                                                                                                  
 batch_normalization_9 (BatchNo  (None, 88, 128)     512         ['conv1d_10[0][0]']              
 rmalization)                                                                                     
                                                                                                  
 activation_9 (Activation)      (None, 88, 128)      0           ['batch_normalization_9[0][0]']  
                                                                                                  
 conv1d_11 (Conv1D)             (None, 88, 128)      49280       ['activation_9[0][0]']           
                                                                                                  
 batch_normalization_10 (BatchN  (None, 88, 128)     512         ['conv1d_11[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_4 (Add)                    (None, 88, 128)      0           ['batch_normalization_10[0][0]', 
                                                                  'activation_8[0][0]']           
                                                                                                  
 activation_10 (Activation)     (None, 88, 128)      0           ['add_4[0][0]']                  
                                                                                                  
 conv1d_12 (Conv1D)             (None, 44, 256)      98560       ['activation_10[0][0]']          
                                                                                                  
 batch_normalization_11 (BatchN  (None, 44, 256)     1024        ['conv1d_12[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_11 (Activation)     (None, 44, 256)      0           ['batch_normalization_11[0][0]'] 
                                                                                                  
 conv1d_13 (Conv1D)             (None, 44, 256)      196864      ['activation_11[0][0]']          
                                                                                                  
 batch_normalization_12 (BatchN  (None, 44, 256)     1024        ['conv1d_13[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 conv1d_14 (Conv1D)             (None, 44, 256)      33024       ['activation_10[0][0]']          
                                                                                                  
 add_5 (Add)                    (None, 44, 256)      0           ['batch_normalization_12[0][0]', 
                                                                  'conv1d_14[0][0]']              
                                                                                                  
 activation_12 (Activation)     (None, 44, 256)      0           ['add_5[0][0]']                  
                                                                                                  
 conv1d_15 (Conv1D)             (None, 44, 256)      196864      ['activation_12[0][0]']          
                                                                                                  
 batch_normalization_13 (BatchN  (None, 44, 256)     1024        ['conv1d_15[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_13 (Activation)     (None, 44, 256)      0           ['batch_normalization_13[0][0]'] 
                                                                                                  
 conv1d_16 (Conv1D)             (None, 44, 256)      196864      ['activation_13[0][0]']          
                                                                                                  
 batch_normalization_14 (BatchN  (None, 44, 256)     1024        ['conv1d_16[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_6 (Add)                    (None, 44, 256)      0           ['batch_normalization_14[0][0]', 
                                                                  'activation_12[0][0]']          
                                                                                                  
 activation_14 (Activation)     (None, 44, 256)      0           ['add_6[0][0]']                  
                                                                                                  
 average_pooling1d (AveragePool  (None, 22, 256)     0           ['activation_14[0][0]']          
 ing1D)                                                                                           
                                                                                                  
 flatten (Flatten)              (None, 5632)         0           ['average_pooling1d[0][0]']      
                                                                                                  
 dense (Dense)                  (None, 2048)         11536384    ['flatten[0][0]']                
                                                                                                  
 dropout (Dropout)              (None, 2048)         0           ['dense[0][0]']                  
                                                                                                  
 dense_1 (Dense)                (None, 1024)         2098176     ['dropout[0][0]']                
                                                                                                  
 dropout_1 (Dropout)            (None, 1024)         0           ['dense_1[0][0]']                
                                                                                                  
 output_barcode (Dense)         (None, 8)            8200        ['dropout_1[0][0]']              
                                                                                                  
==================================================================================================
Total params: 14,628,104
Trainable params: 14,624,136
Non-trainable params: 3,968
__________________________________________________________________________________________________
