Comment:Reproducing quipu with non repeated to obtain a baseline to compare. But we use a noise std which makes sense and non repeated classes
---Data augmentation config:---
stretch_std: 0.1
magnitude_std: 0.1
stretch_prob: 0.5
noise_std: 0.02
brow_std: 0.9
opt_aug: False
---Data train config:---
n_epochs_max: 100
lr: 0.0001
batch_size: 512
early_stopping_patience: 18
brow_aug_use: True
use_weights: True
---Data load config:---
min_perc_test: 4
max_perc_test: 15
---Model summary:---
Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input (InputLayer)          [(None, 700, 1)]          0         
                                                                 
 conv1d (Conv1D)             (None, 700, 64)           512       
                                                                 
 batch_normalization (BatchN  (None, 700, 64)          2800      
 ormalization)                                                   
                                                                 
 activation (Activation)     (None, 700, 64)           0         
                                                                 
 conv1d_1 (Conv1D)           (None, 700, 64)           28736     
                                                                 
 batch_normalization_1 (Batc  (None, 700, 64)          2800      
 hNormalization)                                                 
                                                                 
 activation_1 (Activation)   (None, 700, 64)           0         
                                                                 
 max_pooling1d (MaxPooling1D  (None, 233, 64)          0         
 )                                                               
                                                                 
 dropout (Dropout)           (None, 233, 64)           0         
                                                                 
 conv1d_2 (Conv1D)           (None, 233, 128)          41088     
                                                                 
 batch_normalization_2 (Batc  (None, 233, 128)         932       
 hNormalization)                                                 
                                                                 
 activation_2 (Activation)   (None, 233, 128)          0         
                                                                 
 conv1d_3 (Conv1D)           (None, 233, 128)          82048     
                                                                 
 batch_normalization_3 (Batc  (None, 233, 128)         932       
 hNormalization)                                                 
                                                                 
 activation_3 (Activation)   (None, 233, 128)          0         
                                                                 
 max_pooling1d_1 (MaxPooling  (None, 77, 128)          0         
 1D)                                                             
                                                                 
 dropout_1 (Dropout)         (None, 77, 128)           0         
                                                                 
 conv1d_4 (Conv1D)           (None, 77, 256)           98560     
                                                                 
 batch_normalization_4 (Batc  (None, 77, 256)          308       
 hNormalization)                                                 
                                                                 
 activation_4 (Activation)   (None, 77, 256)           0         
                                                                 
 conv1d_5 (Conv1D)           (None, 77, 256)           196864    
                                                                 
 batch_normalization_5 (Batc  (None, 77, 256)          308       
 hNormalization)                                                 
                                                                 
 activation_5 (Activation)   (None, 77, 256)           0         
                                                                 
 max_pooling1d_2 (MaxPooling  (None, 25, 256)          0         
 1D)                                                             
                                                                 
 dropout_2 (Dropout)         (None, 25, 256)           0         
                                                                 
 flatten (Flatten)           (None, 6400)              0         
                                                                 
 dense (Dense)               (None, 2048)              13109248  
                                                                 
 dropout_3 (Dropout)         (None, 2048)              0         
                                                                 
 dense_1 (Dense)             (None, 1024)              2098176   
                                                                 
 dropout_4 (Dropout)         (None, 1024)              0         
                                                                 
 output_barcode (Dense)      (None, 8)                 8200      
                                                                 
=================================================================
Total params: 15,671,512
Trainable params: 15,667,472
Non-trainable params: 4,040
_________________________________________________________________
